package eting;

import java.util.Random;

/**
 * Created by lifenjoy51 on 14. 12. 26.
 */
public class TestUtil {

    //이야기 생성하기
    public static String randomStoryText() {
        int length = (int) ((Math.random()*25)+(Math.random()*5));
        return getText(length);
    }

    //답글 생성하기
    public static String randomReplyText() {
        int length = (int) ((Math.random()*15)+(Math.random()*3));
        return getText(length);
    }

    //문장생성
    private static String getText(int length){

        StringBuffer buffer = new StringBuffer();
        Random random = new Random();

        String chars[] = "도민준 ^엑소 ^백현 ^경수 ^세훈 ^민석 ^훙느 ^수현 ^종대 ^종인 ^여시 ^도매니저 ^쭉빵 ^수지 ^씹창 ^썅 ^뒈져라 ^죽어버려 ^빠구리 ^씹년 ^씨발 ^씨팔 ^조까 ^좃까 ^창년 ^좆 ^존나 ^찬열 ^으르렁 ^두산 ^010 ^인스티즈 ^송은이 ^시우민 ^틱톡 ^톡디 ^박력 ^패스 ^찾아요 ^아이디 ^설레 ^발정난 ^음탕녀 ^노예녀 ^노예남 ^정액 ^섹파 ^팸섭 ^대딸 ^야쳇 ^야챗 ^야한대화 ^변남 ^변녀 ^폰섹 ^섹스 ^오르가 ^시발 ^꺼져 ^exo ^뉴빵 ^모카 ^쌍코 ^야톡 ^자위 ^너목 ^별그대 ^일베 ^ 운지 ^김치녀 ^추천 ^톡줘 ^톡할래 ^애할래 ^락할래 ^ㅅㅂ ^pass ^아디 ^http ^돈버는어플 ^원장류 ^ 라인 ^비스트 ^룸메 ^B.A.P ^톡해 ^ㅋㅋㅋㅋㅋ ^.com ^샤이니 ^라인해 ^톡하자 ^아이딘 ^카톡하자 ^깜짝 ^보내면 ^내가 ^또 ^모양으로 ^병자에 ^그리 ^밥을죽이지. ^김첨지의 ^생생하며, ^학교 ^것보다도 ^진날에는 ^피다. ^보더니 ^야단을 ^하고 ^사라지기 ^스케이트 ^찰깍하고 ^하나. ^웃음 ^논다니와 ^아마 ^증을 ^음악을 ^섰을 ^어디까지 ^과한데. ^앓는 ^검은 ^중대가리 ^돌아를간담. ^없으면, ^힘들 ^있다는 ^물같이 ^부르짖었다. ^모르다가 ^프로그래밍은 ^인력거가 ^조금 ^것이다. ^눈이 ^앱들 ^죽은 ^그러고도 ^정당한 ^못 ^아니라 ^청하였다. ^줄 ^부사장님과, ^투명하되 ^덮이고, ^희망의 ^천지는 ^눌렀다. ^듯이 ^오늘은 ^가진 ^받아 ^빌어먹을, ^돈을 ^복제와 ^타시랍시요. ^살진 ^이것이야말로 ^않은 ^잊을 ^내리었다. ^같은 ^천자만홍이 ^자기를 ^환자는 ^눈은 ^벌었단 ^차차 ^얼굴이 ^없었다.크게 ^모를 ^명이나 ^미친놈, ^기이한 ^말아. ^바라보며 ^젠장맞을 ^남을 ^무서운 ^사다줄 ^하고 ^쳤다. ^너비아니 ^나올 ^판매되기를 ^일 ^주워주는 ^가요. ^떼고 ^십 ^함께 ^대로 ^뭐, ^하고 ^껴들어 ^만족하였음일까? ^새삼스러운 ^썅 ^짐은 ^놈이야. ^아내에게 ^원 ^김첨지의 ^없으리라고 ^방지하는 ^경련적으로 ^되었다. ^오십 ^연결해서 ^그리고, ^가장 ^부어. ^아니라는 ^어떤 ^얼마나 ^게 ^모르리라. ^들고 ^하더니 ^심지어 ^나올 ^있다. ^놓을 ^넘어 ^갑절이 ^각색의 ^하고 ^돈 ^나왔으랴. ^아내의 ^그러나 ^덮친 ^양양. ^눈깔 ^있거니와, ^풀이 ^앞에 ^내기를 ^괴로운 ^앉았으면 ^그 ^듯하다.못쓸 ^모양으로 ^싸게 ^가까운 ^시원치는 ^정거장 ^저렇게 ^가. ^차지하고 ^말이 ^아이폰에 ^유물이 ^탁 ^하고 ^펴서 ^인간은 ^아니올시다. ^주정꾼은 ^이전에도 ^놓고 ^문득 ^모양일세 ^밥을 ^자라났다. ^놀란 ^지랄을 ^저도 ^남편이 ^나무등걸이나 ^한 ^먹여 ^얼굴은 ^있었다. ^따름이요, ^어디 ^정거장 ^다리를 ^세든 ^남은 ^먹여 ^뛰어나왔음이리라. ^않아 ^켕긴다 ^아이디어로 ^함이로다. ^무엇만 ^앱이 ^첩 ^괴상하게 ^몰랐다. ^이 ^인형을 ^같은 ^눈길을 ^치삼의 ^뿐이다. ^붓지 ^얼굴로, ^우중에 ^난봉 ^꾸며 ^끝까지 ^남비에 ^가요. ^옴붙어서 ^주먹덩이 ^하고는 ^나무등걸과 ^가방을 ^어디신가요? ^여자의 ^환자가 ^딴판으로 ^부사장님과, ^가벼워져서 ^들어본 ^가요. ^돌며 ^앱들은 ^없이, ^밑에서 ^이것이다.뭐야, ^기회를 ^이상하게 ^있다. ^어깨를 ^꿈 ^같이 ^주기를 ^쓸쓸하랴? ^그래, ^뭔지가 ^준비물은 ^샘물 ^아이디어로 ^과한데. ^이 ^않은 ^비를 ^모조리 ^하늘은 ^자기를 ^하게. ^그렇지만 ^시장도 ^바로 ^치삼의 ^신이 ^중대가리 ^조랑복은 ^죽어. ^나한테 ^그 ^걸 ^어떻게 ^놀란 ^체한 ^팔을 ^구하지 ^말이요. ^유료 ^뜨며 ^미끄럽기도 ^찾아 ^미인을 ^소리와 ^말이요. ^이러다가 ^옹송그려지며 ^뼉다구를 ^죽어, ^뜻이다. ^수 ^바이며, ^여기서 ^기업에 ^친구를 ^응 ^지났구나. ^추기 ^돈은 ^풀이 ^우리의 ^바이며, ^데는 ^한구석에 ^하나."
                .split("\\^");

        for (int i = 0; i < length; i++) {
            buffer.append(chars[random.nextInt(chars.length)]);
        }
        return buffer.toString();
    }

}
